{"id": "1nncvpa", "created_utc": 1758514754.0, "subreddit": "conspiracy", "text": "This is a friendly reminder that EVERYONE was at Charlie Kirk's memorial service besides his parents and sister… Not suspicious at all. Carry on👁️", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nncvpa.jpg"], "label": 0}
{"id": "1nnhreb", "created_utc": 1758533043.0, "subreddit": "conspiracy", "text": "What do we think?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnhreb.jpg"], "label": 0}
{"id": "1nnpwig", "created_utc": 1758555591.0, "subreddit": "conspiracy", "text": "Photo of Mother Teresa with Robert Maxwell I’ve seen claims that Mother Teresa and Robert Maxwell were connected, even tied to trafficking. Has this been historically founded, unproven, or debunked?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnpwig.jpg"], "label": 0}
{"id": "1nnclds", "created_utc": 1758513788.0, "subreddit": "conspiracy", "text": "So Israel killing Americans is becoming a thing now…", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnclds.jpg"], "label": 0}
{"id": "1nn23vm", "created_utc": 1758485068.0, "subreddit": "conspiracy", "text": "This is Israel’s vote. This woman is under contract with them. I believe this woman is either blackmailed or given a ton of money in exchange for her to vote like this. It’s no longer the United States. It’s Israel, and this is why the machine will never stop. There will be an endless cycle of power and money exchanged between us and Israel and the codependency has grown too strong for anything to change.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nn23vm.jpg"], "label": 0}
{"id": "1nnt9rg", "created_utc": 1758563093.0, "subreddit": "conspiracy", "text": "Tragedy turned into spectacle, chaos into propaganda, all pointing to the same agenda. At this point it couldn't be clearer, their goal is on display. A staged threat, a Turning Point, designed to justify massive change. It's a ritualized narrative: one man falls, and the message is that the entire population is under fire. How blind do you have to be to not see it?\n\nThis is just the beginning, the pretext for more control, more surveillance, and a new chapter in their agenda.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnt9rg.jpg"], "label": 0}
{"id": "1nnhjct", "created_utc": 1758532168.0, "subreddit": "conspiracy", "text": "Hades CIA spy plane ?? Saw this scrolling on x and thought it was interesting. Posting the video below.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnhjct.jpg"], "label": 0}
{"id": "1nn82zf", "created_utc": 1758500421.0, "subreddit": "conspiracy", "text": "Bait and switch Wrath was convenient until it wasn’t. Now this 🧃 wall-kisser quotes Our Father?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nn82zf.jpg"], "label": 0}
{"id": "1nnn6gj", "created_utc": 1758549404.0, "subreddit": "conspiracy", "text": "So we think US will announce anything about aliens any time soon?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnn6gj.jpg"], "label": 0}
{"id": "1nnfmh3", "created_utc": 1758524544.0, "subreddit": "conspiracy", "text": "The holy grail of conspiracies", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnfmh3.jpg"], "label": 0}
{"id": "1nn5jsm", "created_utc": 1758493468.0, "subreddit": "conspiracy", "text": "They're going to LITERALLY saint him, aren't they?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nn5jsm.jpg"], "label": 0}
{"id": "1nnoqlb", "created_utc": 1758552988.0, "subreddit": "conspiracy", "text": "Didnt want to get into it but here we are So let me get this straight. The autopsy was done within a day and he was ready to be buried not even 48 hours after the death. Now a week later they find out he was a “miraculous” death and saved others. How much more bullshit christian nonsense are they gonna throw at us. Im catholic and think the way this is being treated is disgusting. His wifes a tool. The whole worlds a stage. Where is his immediate family. How many times are politicians (left+right) going to capitalize on the deaths of americans. This is like a running joke at this point and whoever cant see that is an npc. That is all", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnoqlb.jpg"], "label": 0}
{"id": "1nmo1g9", "created_utc": 1758448819.0, "subreddit": "conspiracy", "text": "30-06 bullet was miraculously stopped by Charlie Kirk body and found just inside the skin For reference, video of 30-06 tested on steel plates: https://youtu.be/FLCJzP0VJh8", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmo1g9.jpg"], "label": 0}
{"id": "1nnsxi4", "created_utc": 1758562335.0, "subreddit": "conspiracy", "text": "It really looks like it is behind and above the power lines to me. They had a camera in 1950. I'm not sure how common that was so one of them may have worked in media production.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnsxi4.jpg"], "label": 0}
{"id": "1nmtka3", "created_utc": 1758465244.0, "subreddit": "conspiracy", "text": "What's everyone's thoughts? I spotted this on a car groups post on fb earlier & there wasn't much info on there has they were all just saying how it makes them seem less trustworthy.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmtka3.jpg"], "label": 0}
{"id": "1nmplc4", "created_utc": 1758454383.0, "subreddit": "conspiracy", "text": "Elon is also a Shabbos goy Title*\nSo you spend only life that you have worshiping a billionaire, offer your pay raise, health care, your children's future,  to just to find out that  you are just part of many manipulated people drawn in a scheme that has been running for centuries.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmplc4.jpg"], "label": 0}
{"id": "1nmshm6", "created_utc": 1758462622.0, "subreddit": "conspiracy", "text": "It never ends ok It’s all a farce, full video: \nhttps://www.instagram.com/reel/DKkKynOImB6/?igsh=MTcyYWhoZTgyOHEzdg==", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmshm6.jpg"], "label": 0}
{"id": "1nnthke", "created_utc": 1758563579.0, "subreddit": "conspiracy", "text": "Erika Frantzve Kirk was Miss Arizona in 2012, which was owned by Trump at the time", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnthke.jpg"], "label": 0}
{"id": "1nnaka3", "created_utc": 1758507562.0, "subreddit": "conspiracy", "text": "Friends once more Looks like Kirk’s death mended a fence or two", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnaka3.jpg"], "label": 0}
{"id": "1nnnp42", "created_utc": 1758550609.0, "subreddit": "conspiracy", "text": "Ukraine was created for ill means by followers of Moloch (Remphan) https://mythdetector.com/en/where-does-the-coat-of-arms-of-ukraine-originate-from-and-what-do-conspiracy-theorists-associate-it-with/", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnnp42.jpg"], "label": 0}
{"id": "1nnnar5", "created_utc": 1758549684.0, "subreddit": "conspiracy", "text": "Star of Moloch (Remphan) has been co-opted by Israel. Star of David or star of Israel's false god Remphan mentioned in Acts 7:43?\n\nIn his final sermon before he was martyred, Stephen recited the history of rebellious Israel. Referring to the idolatry of the ancient Israelites, Stephen mentioned the god Molech and “the star of your god Rephan” (Acts 7:43). Other versions of the Bible spell the name of the false god as Remphan (KJV, NKJV) or Rompha (NASB, AMP). They are all talking about the same false god.\n\nIn the context of Stephen’s reference to “the star of your god Rephan,” he mentions the golden calf that Israel worshiped at Sinai (Acts 7:39–41). He then says that “God turned away from them and gave them over to the worship of the sun, moon and stars” (verse 42). One of those “stars” they worshiped was the star of Remphan (verse 43). Finally, Stephen points to God’s determination to send Israel into exile in Babylon (verse 43). Stephen’s argument before the Sanhedrin was that the current generation of Israel was just as “stiff-necked” as their ancestors, “always resist[ing] the Holy Spirit!” (verse 51). They had proved their stubbornness in their rejection of Jesus Christ.\n\nWhen he referred to the “star of your god Rephan,” Stephen was quoting the Greek translation of the Old Testament Scriptures known as the Septuagint, or LXX. This translation by Hebrew scholars was completed about the third century BC. The passage Stephan quotes is Amos 5:26, which in an English translation of the LXX reads, “Yea, ye took up the tabernacle of Moloch, and the star of your god Raephan, the images of them which ye made for yourselves” (tr. by Sir Lancelot Brenton, 1851).\n\nIn the Hebrew text of Amos 5:26, the name the LXX translates as “Raephan” is Kiyun, spelled Chiun (KJV), Kaiwan (NLT, CSB), or Kiyyun (ESV), depending on the Bible version. Some versions, such as the NIV, do not transliterate the word at all.\n\nThe International Standard Bible Encyclopedia identifies Rephan as “the Babylonian name for the god of the planet Saturn.” The International Standard Bible translates Amos 5:26 as “And you carried the tent of your king—and Saturn, your star god idols that you crafted for yourselves.” Smith’s Bible Dictionary and Easton’s Bible Dictionary also link Rephan (or Remphan) to the god Saturn.\n\nIt seems the Babylonians worshiped a god of their own imagination and named him “Kiyun,” whose place in the heavens was as a “wandering star” that they also named “Kiyun” after their god. All the ancient peoples had observed that some stars—in actuality planets—moved through the sky, while other stars—the genuine stars—were fixed. (The Greek term asteres planētai, shortened to just planētai, meant “wandering stars.”) The ancients made no distinction between stars and planets; to them, they were all stars of some type. Thus, Saturn was considered a “star,” and the deity associated with him was a “star-god.”\n\nThe god Kiyun was worshiped among the ancient Babylonians, Arabs, Syrians, and Assyrians. Every false god had its representation, its idol. Molech was represented by a brass bull; Astarte by a tree; Dagon by a half-man, half-fish; and Kiyun by a star—the wandering “star” we know as the planet Saturn.\n\nIn short, “the star of your god Rephan” mentioned in Acts 7:43 is a pagan god that some ancient Israelites unwisely worshiped in the wilderness. The name Rephan is an English translation of the LXX translation of the Hebrew word Kiyun.\n\nMany some theorizes, the star of Remphan represented the Jews who rejected the Holy Spirit of God and worshiped an false god. The citizens of the country named Israel today also rejected the Holy Spirit of God and rebel against God leaving the six-pointed Star of David featured on the Jewish flag to represent that same rebellion against the Holy Spirit today.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnnar5.jpg"], "label": 0}
{"id": "1nnrscf", "created_utc": 1758559774.0, "subreddit": "conspiracy", "text": "Erika being compared to Esther Esther fouled Haman’s plan to exterminate the Jews. Fox News is comparing Erika Kirk to biblical Esther. “Project Esther is a project of The Heritage Foundation, a conservative think tank based in Washington, D.C., that aims to suppress pro-Palestinian protests and what it classifies as antisemitism. The effort has received support from several evangelical Christian organizations but no major Jewish ones.” This is the fishiest part of this all for me. I’d love some help digging.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnrscf.jpg"], "label": 0}
{"id": "1nmgx59", "created_utc": 1758423271.0, "subreddit": "conspiracy", "text": "Breaking: Independent journalist Ryan Matta just received a call and intel that Israel is planning on carrying out false flag attacks on US soil, using sleeper cells disguised as Al Qaeda. Al Qaeda was created by Israel and the Israel-controlled CIA specifically to carry out proxy attacks. Buckle up Here's the X post with video of Ryan Matta explaining further: https://x.com/RyanMattaMedia/status/1969461251064348855?t=CCA7TVIU0s-VY5o15kMVGg&s=19\n\nFox News Full Israeli 9/11 Report with Brit Hume and Carl Cameron describing how Israel infiltrated our entire government and military right before 9/11: https://youtu.be/euoHYWD5C_U?si=HTzS7Olu6pZVClGX\n\n#Israel working with CIA to create Terrorism\n\n\"How Israel helped create Hamas\" https://www.washingtonpost.com/news/worldviews/wp/2014/07/30/how-israel-helped-create-hamas/\n\n\"Israel and the U.S. CREATED Hamas, Hezbollah and Al Qaeda\" https://www.sott.net/article/253764-Israel-and-the-US-CREATED-Hamas-Hezbollah-and-Al-Qaeda\n\n\n\"All the evidence point to the fact that ISIS was created by the US & Israel and funded by Saudi Arabia\" https://themillenniumreport.com/2019/06/all-the-evidence-point-to-the-fact-that-isis-was-created-by-the-us-israel-and-funded-by-saudi-arabia\n\n#The Dancing Israelis\n\n\"A NATION CHALLENGED: THE DETAINEES; Dozens of Israeli Jews Are Being Kept in Federal Detention\"\n\n\n>The five aroused attention in New Jersey after people noticed them going to unusual lengths to photograph the World Trade Center ruins and making light of the situation\n. \n>**One photograph developed by the F.B.I. showed Sivan Kurzberg holding a lighted lighter in the foreground, with the smoldering wreckage in the background, said Steven Noah Gordon, a lawyer for the five.**\n\nhttps://www.nytimes.com/2001/11/21/us/nation-challenged-detainees-dozens-israeli-jews-are-being-kept-federal-detention.html\n\n#Israel Foreknowledge of 9/11\n\n\"[Israeli] Odigo Says Workers Were Warned of Attack\"\n\n>Odigo, the [Israeli] instant messaging service, says that two of its workers received messages two hours before the Twin Towers attack on September 11 predicting the attack would happen.\n\nhttps://www.haaretz.com/2001-09-26/ty-article/odigo-says-workers-were-warned-of-attack/0000017f-dbc4-df62-a9ff-dfd7beff0000 - https://archive.is/uL4DT\n\n\n\n\"Israeli firm escapes harm from attack: Shipping company **moved out a week before Sept. 11\"**\n\n>Thanks to a stroke of good luck and fortunate timing, at least one World Trade Center company escaped relatively unscathed from the Sept. 11 terrorist attacks.\n\n>At one time, **Zim American Israeli Shipping Co. Inc.** had roughly 200 workers on the 16th and 17th floors of One World Trade Center, the first building hit by a jetliner in the assault on New York.\n\nhttps://www.marketwatch.com/story/israeli-shipper-escapes-harm-from-attack\n\n#Netanyahu says 9/11 benefitted Israel\n\n\n\"A DAY OF TERROR: THE ISRAELIS; Spilled Blood Is Seen as Bond That Draws 2 Nations Closer\"\n\n>Asked tonight what the attack meant for relations between the United States and Israel, Benjamin Netanyahu, the former prime minister, replied, **''It's very good.'**\n\nhttps://www.nytimes.com/2001/09/12/us/day-terror-israelis-spilled-blood-seen-bond-that-draws-2-nations-closer.html\n\n\"Quotable: Netanyahu says Israel benefitted from 9/11\"\n\n>This is sure to provide fodder for conspiracy theorists in the Middle East:\n\n>The Israeli newspaper Ma’ariv on Wednesday reported that Likud leader Benjamin Netanyahu told an audience at Bar Ilan university that the September 11, 2001 terror attacks had been beneficial for Israel.\n\n>**\"We are benefiting from one thing, and that is the attack on the Twin Towers and Pentagon, and the American struggle in Iraq,\"** Ma’ariv quoted the former prime minister as saying. He reportedly added that these events \"swung American public opinion in our favor.\"\n\nhttps://foreignpolicy.com/2008/04/16/quotable-netanyahu-says-israel-benefitted-from-911/?utm_source=chatgpt.com (archive - https://archive.is/2ymrs)", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmgx59.jpg"], "label": 0}
{"id": "1nmhgfl", "created_utc": 1758425004.0, "subreddit": "conspiracy", "text": "Interesting Tweet… Made a month before his assassination…", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmhgfl.jpg"], "label": 0}
{"id": "1nn6k6w", "created_utc": 1758496157.0, "subreddit": "conspiracy", "text": "Where are Charlie’s parents? Have they made any comments or anyone know anything about where they are?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nn6k6w.jpg"], "label": 0}
{"id": "1nnt6q1", "created_utc": 1758562904.0, "subreddit": "conspiracy", "text": "How I see the US veto", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnt6q1.jpg"], "label": 0}
{"id": "1nmnp7h", "created_utc": 1758447533.0, "subreddit": "conspiracy", "text": "Why do all presidents have to wear the jewish hat", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmnp7h.jpg"], "label": 0}
{"id": "1nniqr7", "created_utc": 1758536641.0, "subreddit": "conspiracy", "text": "Weird Captcha while trying to setup bridges on Tor I was setting up bridges on tor and I got prompted with this Captcha which appears to be of charlie Kirks shirt when he was shot (the word freedom on a white background) this happened a few days to a week after the shooting.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nniqr7.jpg"], "label": 0}
{"id": "1nmcf13", "created_utc": 1758409803.0, "subreddit": "conspiracy", "text": "MORE NEW WARS! - I wonder  which little country in the Middle East wants us back in Afghanistan 😉?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmcf13.jpg"], "label": 0}
{"id": "1nlxix0", "created_utc": 1758373108.0, "subreddit": "conspiracy", "text": "Thoughts on this mysterious one glove man running after the shooting?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nlxix0.jpg"], "label": 0}
{"id": "1nmcx5d", "created_utc": 1758411188.0, "subreddit": "conspiracy", "text": "Daily reminder there are no headlines of an expert who verified Trump's incriminating signature on his sick letter to Epstein. This post is like staring at a freak with a mutual acknowledgement they are essentially an anti-American spy larping as Uncle Sam incarnate.\n\nIf Ashkenazis lose their anti-semitic card by being recognized as white Slavs, Israel has no psuedo-race card to play like a vague \"anti-semitic\" rebuttal. \n\nDeport the bastard before he divides any more of us.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmcx5d.jpg"], "label": 0}
{"id": "1nmurus", "created_utc": 1758468106.0, "subreddit": "conspiracy", "text": "Lots of random pr0paganda subs popping up on my feed. Some said all opinions accepted. And…. And I didn’t have the right opinion.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmurus.jpg"], "label": 0}
{"id": "1nnegwj", "created_utc": 1758520269.0, "subreddit": "conspiracy", "text": "Erika Kirk’s rings from the service What do they symbolize??", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnegwj.jpg"], "label": 0}
{"id": "1nly9qw", "created_utc": 1758375101.0, "subreddit": "conspiracy", "text": "Another update on this camera footage.  Candace Owens spoke directly to the guy and was able to view the footage.  There is no exit damage on the backside of Charlie anywhere.  She is trying to get the footage RELEASED. \nTitle typo corrected.\n\nFollow up to this post:\n\nhttps://www.reddit.com/r/conspiracy/s/RRfRmVqlRJ\n\nAfter Ben Shapiro was so rapidly named as the new successor to the brand, I immediately pulled up the board member names of TPUSA.  \n\n#vvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvvv\n\nIf I was in charge of this investigation I would’ve subpoenaed all communications of the  TPUSA board of directors immediately.  This was a hostile takeover.\n\nhttps://www.reddit.com/r/conspiracy/s/AIigWVrjWQ", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nly9qw.jpg"], "label": 0}
{"id": "1nm6lp2", "created_utc": 1758395046.0, "subreddit": "conspiracy", "text": "So is this considered hate speech? Who is the idiot ? And what makes him for being under him? \n\n\nI know this is old but , make it make sense.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nm6lp2.jpg"], "label": 0}
{"id": "1nnqte6", "created_utc": 1758557632.0, "subreddit": "conspiracy", "text": "Debunking the horned hand sign and its hidden meanings. Many are being falsely misled into believing it means “I love you humanity”, which is not the case at all. That’s just want they want people to think. These dark occultists operate via deception and manipulation. Debunking the horned hand sign and its hidden meanings. Many are being falsely misled into believing it means “I love you humanity”, which is not the case at all. That’s just want they want people to think. These dark occultists operate via deception and manipulation, we must be aware of how they operate to better protect others and no longer be deceived by the narratives they want humanity to think. When humanity realises how the language of symbolism operates, a huge awakening and shift will occur. Hidden in plain sight symbolism is how those apart of cults operate. Basically they’re telling us, without telling us who they are. They always speak in code, telling us who they’re in allegiance with via symbols, signs, numbers, colours etc the list goes on. They also use such hand signs to cast spells on people. \n\nHorned Hand or The Mano Cornuto\n\n“The two fingers pointing upwards represent the horns of Satan. This sign can be made in the following ways:\n -With the index and the pinkie fingers raised, and the thumb over the folded middle and ring fingers. The thumb over the fingers is the Satanic salute in occultism. It is a sign of recognition between those who are in the occult. When pointed at someone, it means to cast a spell. This sign is made with the left hand. Anton LaVey, founder of the Church of Satan and author of the Satanic Bible, was constantly throwing this hand gesture. On the back of his Bible, there is a picture of him doing it with his left hand. The following is an excerpt from what he wrote in his Satanic Bible: \"...This gesture is the Satanic salute, a sign of recognition between and allegiance of members of Satanism or other unholy groups. I love you Satan.\"\n\n—With the index and the pinkie pointing up, the middle and ring fingers folded and the thumb extended. This signifies I love you Satan.\nIn American Sign Language, this hand sign made with an extended thumb, is the muted sign for the phrase \"I love you (ILY)\". It was created by Helen Keller (1880-1968), a practicing occultist and theosophist. Helena Blavatsky, who founded the Theosophical Society, was a 32° Freemason and a devout Satan worshipper who was an enemy of Christ. She is also one of the pioneers of today's occult New Age Movement. She wrote in her book 'Lucifer A Theosophical Magazine':\n* \"Lucifer represents.. Life.. Thought.. Progress.. Civilization.. Liberty.. Independence.. Lucifer is the Logos.. the Serpent, the Savior.\" |Pages 171, 225, 255 (Volume II)|\n* \"It is Satan who is the God of our planet and the only God.\" |pages 215, 216, 220, 245, 255, 533, (VI)|\n\nSome say that this hand gesture has nothing to do with Satanism and is only associated with the University of Texas Longhorn soccer team. But that doesn't explain why the sign is widely and globally used by celebrities, prominent people and non-American celebrities who did not grow up in Texas or attended the University of Texas, or have any sort of affiliation with Texas. Why then are they all doing this hand gesture?” - Les Versets Bibliques. \n\n“Knowing how nothing is exactly what it seems, we need to have a minimum of insight in order to identify those perverted things that have an effect on us on a subconscious level.\n \nIn Kabbalah the tradition is to hide symbols in plain sight while preserving their real significance. Hand signs allow occultists to convey a strong message or a hidden equilibrium. Satanic groups are known to use these hand signs to evoke hidden demonic entities with the purpose of communicating subliminal messages, meant to intimidate, subjugate others to their will or to cast spells and magical chaos. Satanic Hand gestures are also a method of affirming that one belongs to a particular satanic group, and their way of telling Satan they love him.\n\nThe devil's horns hand gesture is known by several names, including: the horns sign, El Diablo, the sign of Satan the horned god, goat horns, Rock On, Rock Fist, Mano Cornuto, Il Cornuto, Pommesgabel, Evil Fingers, metal horns, sign of the devil… The devil's horns are one of the most widely recognized symbols of", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnqte6.jpg"], "label": 0}
{"id": "1nmk1dz", "created_utc": 1758433871.0, "subreddit": "conspiracy", "text": "Account Warning for commenting on Isreal involvement in Kirks death and possible upcoming attacks. Id say they are actively manipulative public opinion ON THIS PLATFORM. Could of be reported by someone but i doibt it. Seems like an automated strike bases simply on the sentiment of what i had stated. Can't even go back and get the exact wording of what i said but it was a short comment about how they had more than likely killed Kirk and that the narrative wasn't working so they were threatening violence against American civilians.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmk1dz.jpg"], "label": 0}
{"id": "1nm7kvi", "created_utc": 1758397386.0, "subreddit": "conspiracy", "text": "Nothing to see here", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nm7kvi.jpg"], "label": 0}
{"id": "1nmep9x", "created_utc": 1758416436.0, "subreddit": "conspiracy", "text": "!̷̡͓̭̩̦̫͍̣̲͍̤͖͕̫͈̳̌̓̀͂͌", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmep9x.jpg"], "label": 0}
{"id": "1nnjpk0", "created_utc": 1758539904.0, "subreddit": "conspiracy", "text": "Trump’s Illiterate and His Illiteracy Was Intentional – and Here’s Why Hear me out.\n\nTrump wasn’t just some random outsider who “beat the system.” He was raised for this role by the same people who pull the strings behind the scenes. Look into his history — from the military school days to the business bailouts — it’s clear someone was always making sure he stayed relevant.\n\nHere’s the weird part: it’s been documented multiple times that Trump can’t really read properly. (Seriously, look it up. There are countless clips of him stumbling over basic text.) That’s not just a quirk — that’s by design.\n\nIf you’re trying to build a figurehead for a frustrated population, you don’t pick a polished intellectual. You pick someone who reflects the voters you’re targeting — not too polished, not too “elite.” By making sure he never developed normal reading skills, they crafted someone who communicates simply, repeats himself, and sounds like the “average guy.” That makes him subconsciously more relatable to the demographic they want to energize.\n\nThis isn’t about left vs. right — it’s about control. He was groomed to be exactly what he is: a character that fires up the base, keeps people distracted, and divides the public just enough to stop them from asking who really benefits.\n\nThoughts? Has anyone else noticed how convenient this all is?", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnjpk0.jpg"], "label": 0}
{"id": "1nnsesc", "created_utc": 1758561172.0, "subreddit": "conspiracy", "text": "This is what this sub has become", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nnsesc.jpg"], "label": 0}
{"id": "1nn2js0", "created_utc": 1758486099.0, "subreddit": "conspiracy", "text": "Is it really that person?? So posting for the first time in this group, so little nervous. \n\nThe thing is this particular conspiracy theory (which is more or less have become a mainstream theory now) in India. But of course it's implication is all over the world specially in today's time. \n\nThe context is very complicated, so hard to explain in a short post. But for people with general idea, here is a the context. The Indian independence movement was not just led by Gandhi. In fact, Gandhi had \"minimal\" role in India's independence movement. His faction is often referred to as \"soft faction\" because he wanted to fight British through Non Violent means. \n\nThere was another hard core faction which fought with arms against the British during the 2nd World war. Since \"Enemy's enemy is friend\" that faction was supported by those who ultimately lost the second world war. But nonetheless, the British had to leave India because the military that used to support the British started revolting against them and hence they had to leave India in hurry. \n\nNow the leader of this hard faction was a political figure called Netaji Subhash Chandra Bose. In fact he has become very popular in recent times because Indian Prime Minister raised his statue in own of the most important place of New Delhi. The Central square which used to be called King's Way in olden days. \n\nNow the mystery is, that officially this man was declared dead in 1945 in an air craft accident in the then Formosa (today Taiwan). But of course people believe he didn't die. He just created an illusion of his death to trick the British who were searching for him. He lived till ripe old age of 88 years old and died in 1985. \n\nPeople often say that he was present in the Paris Peace Accord 1973 between America and Vietnam. He was their as an advisor to the Vietnamese delegation. This theory has never been proven but there are manhy legit reasons why people who think that. \nThe photo you see above, they say that the guy in the extreme right standing behind with round face is him. \nThe funny thing is through historical records people can map every person in that photo except this individual. Interesting right?? \n\nIf anyone in this group has any knowledge, they can comment or reach out to me because I am very interested in this case because of some quite personal connection. Yes I live in France. I would really appreciate if someone can help identify this person standing in the extreme right.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nn2js0.jpg"], "label": 0}
{"id": "1nmu8pm", "created_utc": 1758466874.0, "subreddit": "conspiracy", "text": "Was Charlie Kirk an official employee of the Trump administration? Stephen Miller posted this on X the other day. Was this widely known? I had no idea.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmu8pm.jpg"], "label": 0}
{"id": "1nm5ye6", "created_utc": 1758393505.0, "subreddit": "conspiracy", "text": "Israeli media has started reporting on potential al-Qaeda attacks in the US Laura Loomer also elevated the story to her socials. No other American news sites have reported on it besides Newsmax.", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nm5ye6.jpg"], "label": 0}
{"id": "1nlxa2v", "created_utc": 1758372413.0, "subreddit": "conspiracy", "text": "ATTENTION False Flag IT Will Most Likely Be Isreal Carrying Out these attacks If you dont see whats happening the left or right cant help you", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nlxa2v.jpg"], "label": 0}
{"id": "1nmkqrj", "created_utc": 1758436429.0, "subreddit": "conspiracy", "text": "Wait a minute", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmkqrj.jpg"], "label": 0}
{"id": "1nme32p", "created_utc": 1758414568.0, "subreddit": "conspiracy", "text": "This is all really sus", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nme32p.jpg"], "label": 0}
{"id": "1nmsw43", "created_utc": 1758463609.0, "subreddit": "conspiracy", "text": "Jeffrey Epsteam (real)", "ocr": "", "image": ["src/hmama/train/reddit_images\\1nmsw43.jpg"], "label": 0}
